[
  {
    "date": "February 8th, 2025",
    "title": "🌟 Peer Mentoring Club—The Start.",
    "content": "<p> Hey everyone! Today, I want to share the story of how the Peer Mentoring Club came to be. This isn’t just about the club itself—it’s about the journey, the challenges, and the lessons I learned along the way. It all started with an idea, a lot of research, and a determination to make a difference in my school community.</p>\n<br />\n<h3>🌈 The Spark of an Idea</h3>\n<p>The idea for this club didn’t come out of nowhere. It started during my MYP Personal Project, where I was tasked with creating something meaningful that reflected my interests and addressed a real-world problem. For me, that problem was the disconnect I saw among students in my school. I noticed that while we’re all busy with classes, assignments, and extracurriculars, there wasn’t a structured way for older students to support younger ones—or for students to simply connect across grade levels. Many students felt overwhelmed by academic pressures, and others felt isolated, like they didn’t have a place to turn for help or advice. I wanted to change that. I wanted to create a space where students could come together, support one another, and feel like they truly belonged. That’s when the idea for the Peer Mentoring Club was born.</p>\n<br />\n<h3>💡 The Research Phase</h3>\n<p>Once I had the idea, I knew I needed to do my homework. I spent months researching peer mentoring programs, both in schools and in other settings. I wanted to understand what made these programs successful and how I could adapt those ideas for my school. I interviewed school counselors, who shared insights about the importance of creating a safe and structured environment for peer support. I also spoke with students from other schools that had successful peer mentoring programs. One of the most valuable conversations I had was with a friend from another school, who described how their program had positively impacted students’ academic performance and social well-being. This research gave me a clear vision for the club and helped me understand the key elements that would make it successful: academic support, social-emotional connections, and a sense of community.</p>\n<br />\n<h3>🌱 The Challenges: Doubt and Resistance</h3>\n<p>But here’s the thing—bringing this idea to life wasn’t easy. My school has never had a student found a club before, and therefore my idea faced significant opposition from administration. Many people like my classmates doubted I could pull it off. They said it was too ambitious, too complicated, or just not feasible. For a while, it felt like every door was closing. But I didn’t give up. I believed in the idea too much to let it go. I kept pushing, kept advocating, and kept looking for ways to make it happen. Finally, I found two incredible allies: my counsellor and the MYP Coordinator (who also happens to be the vice principal). They saw my passion and determination, and gave me the opportunity to prove that this club could work.</p>\n<br />\n<h3>🚀 The Trial Run</h3>\n<p>With all this knowledge, I decided to test the idea with a trial run. I organized a small-scale peer mentoring session, pairing older students with younger ones for academic support and creating activities to foster connections. The trial run was a learning experience in every sense. I had to figure out how to pair students effectively, plan activities that were engaging but meaningful, and make sure everyone felt comfortable and supported. There were challenges—like coordinating schedules and making sure the activities were inclusive—but the feedback from participants was overwhelmingly positive. Students loved having a space to ask questions, share experiences, and feel supported. It was amazing to see how much of an impact even a small trial run could have.</p>\n<br />\n<h3>📅 Reflecting on the Journey</h3>\n<p>Looking back, the process of creating this club has been one of the most rewarding experiences of my life. It taught me so much about leadership, problem-solving, and the importance of community. The trial run confirmed that a peer mentoring program could make a real difference in my school. It also gave me valuable insights into what works and what we can improve moving forward. Now, as the club officially launches, I’m excited to see how it grows and evolves.</p>\n<br />\n<h3>✨ Why This Matters to Me</h3>\n<p>This club isn’t just about academics or mentorship—it’s about creating a space where everyone feels valued and supported. It’s about building connections and fostering a sense of belonging. Whether it's helping younger students adjust to the high school environment or offering older students leadership opportunities, the Peer Mentoring Club is here to bridge gaps and build a stronger, more connected community. Through these efforts, I hope to inspire positive change throughout my school, making a lasting impact. I am immensely proud to be the founder and president of St. John's School's first and only student-led club—the Peer Mentoring Club.</p>\n<br />\n<h3>🔜 Stay Tuned</h3>\n<p>Stay tuned for the next issue, where I’ll share updates on the first session. See you in the next update!</p>"
  },
  {
    "date": "Febrary 1st, 2025",
    "title": "Placeholder",
    "content": "<p>Placeholder</p>"
  }
]
